{
    "meta": {
          "collection_date": "2026-02-15T01:30:00Z",
          "run_id": "2026-02-15T01",
          "date_range": "2026-02-13 to 2026-02-15",
          "videos_collected": 2,
          "creators": ["CNBC Television", "PND NEWS"],
          "sources": ["youtube_search"],
          "companies_covered": ["OpenAI", "Nvidia", "Google", "Cerebrus", "Meta", "Microsoft", "Anthropic", "Broadcom", "AMD", "Huawei", "Baidu", "Alibaba"]
    },
    "videos": [
          {
                  "video_id": "OwJqcYfIdXM",
                  "title": "AI firms like OpenAI seek Nvidia alternatives",
                  "url": "https://www.youtube.com/watch?v=OwJqcYfIdXM",
                  "creator": "CNBC Television",
                  "channel_url": "https://www.youtube.com/@CNBC",
                  "published_date": "2026-02-13",
                  "duration": "5:17",
                  "views": 24255,
                  "source": "youtube_search",
                  "description": "CNBC's Deirdre Bosa reports on news regarding OpenAI's new chip diversity model, how that impacts Nvidia, and more.",
                  "detailed_summary": "This CNBC report examines OpenAI's strategic move toward chip diversity by unveiling its first AI model (GPT-5.3 Codex Spark) running entirely on Cerebrus chips rather than Nvidia GPUs. The segment features CNBC's Deirdre Bosa analyzing a broader industry trend where major AI companies are diversifying their chip suppliers beyond Nvidia. Google shipped Gemini 3 in December 2025 trained on its custom TPUs, Chinese AI lab released GLM trained on Huawei chips, and Meta and Microsoft are developing their own AI chips. The shift is particularly significant for inference workloads, which represent recurring costs as models scale to millions of users, whereas training is a one-time expense. While OpenAI describes Nvidia as foundational, they're deliberately expanding their ecosystem, with Reuters reporting OpenAI's dissatisfaction with some of Nvidia's latest inference chips. This reflects industry-wide tension as every major AI lab wants Blackwell allocation while simultaneously seeking alternatives to avoid single-supplier dependency. The report discusses supply constraints, Nvidia's pricing power from its near-monopoly position, and how companies like Anthropic are using Google TPUs alongside partnerships with Cerebrus, Broadcom, and AMD. The infrastructure investment narrative is shifting - hundreds of billions will still be spent, but distributed differently. The segment also touches on memory chip competition, noting how Chinese manufacturers have improved capabilities at the lower end, creating market opportunities similar to the high-end chip diversification story. The discussion emphasizes that while Nvidia remains the gold standard for training, the volume game for inference is where ground is being ceded.",
                  "summary_word_count": 284,
                  "chapters": [],
                  "tools_mentioned": [],
                  "key_topics": ["chip diversity", "OpenAI", "Nvidia alternatives", "Cerebrus", "inference workloads", "AI training", "Google TPUs", "Blackwell chips", "supply chain", "semiconductor competition", "Huawei chips", "memory chips", "Chinese AI"],
                  "companies_covered": ["OpenAI", "Nvidia", "Cerebrus", "Google", "Meta", "Microsoft", "Anthropic", "Broadcom", "AMD", "Huawei"]
          },
          {
                  "video_id": "yKfDSoBzlBQ",
                  "title": "Global AI Race 2026: USA vs China vs Japan | Who Will Lead the Future? | PND News",
                  "url": "https://www.youtube.com/watch?v=yKfDSoBzlBQ",
                  "creator": "PND NEWS",
                  "channel_url": "https://www.youtube.com/@PNDNEWS",
                  "published_date": "2026-02-14",
                  "duration": "1:22",
                  "views": 1,
                  "source": "youtube_search",
                  "description": "The global AI race is heating up as the United States, China, and Japan compete for technological dominance. From advanced semiconductor chips to artificial intelligence innovation, this battle could shape the future of the global economy and national security.",
                  "detailed_summary": "This concise PND News report frames the global AI race as a strategic competition among the United States, China, and Japan with implications for global economic and military dominance. The video positions artificial intelligence as a strategic asset determining 21st-century leadership rather than mere science fiction technology. The United States currently leads through companies like Google and OpenAI developing powerful AI systems, with Nvidia providing advanced semiconductors. The US has strategically placed export restrictions on high-end chips to China to maintain technological advantage. China is rapidly expanding AI capabilities through technology giants like Baidu and Alibaba, working to overcome semiconductor restrictions and develop indigenous AI ecosystems. Japan plays a crucial supporting role in AI manufacturing equipment and is strengthening partnerships with the United States to secure supply chains and boost advanced technology production, leveraging its semiconductor manufacturing expertise. The report emphasizes this competition extends beyond innovation to impact global markets, defense systems, employment patterns, and international geopolitical influence. The conclusion positions the AI race as a strategic competition shaping the future balance of global power, arguing that whichever nation leads in artificial intelligence development may define the economic and political landscape for decades to come. The brief format delivers a high-level geopolitical perspective on AI competition dynamics without deep technical detail but emphasizes the existential stakes involved in AI dominance.",
                  "summary_word_count": 217,
                  "chapters": [],
                  "tools_mentioned": [],
                  "key_topics": ["global AI race", "USA AI leadership", "China AI development", "Japan semiconductors", "geopolitical competition", "technological dominance", "export restrictions", "supply chain security", "Baidu", "Alibaba", "national security", "economic impact"],
                  "companies_covered": ["Google", "OpenAI", "Nvidia", "Baidu", "Alibaba"]
          }
    ],
    "excluded_videos": [
          {
                  "title": "15 Best Faceless YouTube Channel Ideas 2026",
                  "creator": "Tube Sensei",
                  "reason": "Tutorial/how-to content, not AI industry news"
          },
          {
                  "title": "How AI, doorbell video could help crack Nancy Guthrie case",
                  "creator": "Fox News",
                  "reason": "AI application in criminal investigation, not AI industry developments"
          },
          {
                  "title": "Talking Point Budget Forum 2026: 'Twin engines' for AI training and support",
                  "creator": "CNA",
                  "reason": "Singapore domestic policy/budget forum, not global AI industry news"
          }
    ],
    "new_creators_found": ["PND NEWS"],
    "processing_notes": [
          "Collection run 2026-02-15T01 - searching for videos within 48-hour window",
          "Previous collections covered: CNBC and Forbes (2026-02-14T18), AI Perspectives and nullmicgo (2026-02-14T23)",
          "This collection focuses on different aspects: OpenAI chip diversification strategy (CNBC) and geopolitical AI competition (PND NEWS)",
          "CNBC video covers hardware/infrastructure angle with focus on Nvidia competition",
          "PND NEWS video provides geopolitical framing of USA-China-Japan AI race",
          "Both videos published within last 48 hours (Feb 13-14, 2026)",
          "Successfully accessed full transcripts for both videos",
          "Company diversity achieved: OpenAI, Nvidia, Cerebrus, Google, Meta, Microsoft, Anthropic, Broadcom, AMD, Huawei, Baidu, Alibaba",
          "Geographic coverage: USA (primary), China (significant), Japan (supporting role)",
          "Content types: TV news analysis (CNBC) and YouTube news commentary (PND NEWS)",
          "Total views at collection time: 24,256 (24,255 + 1)"
    ]
}
